In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
score = Series( [1000, 2000, 3000, 4000,5000])
score

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int64

In [4]:
import pandas as pd

In [5]:
print("pandas version : ", pd.__version__)

pandas version :  1.0.5

In [13]:
step = Series( [1000, 2000, 3000, 2000, 3000] )
step

0    1000
1    2000
2    3000
3    2000
4    3000
dtype: int64

In [14]:
step = Series( [1000, 2000, 3000,2000, 3000],
    index = ["-4일", "-3일", "그제", "어제", "오늘"] )
step

-4일    1000
-3일    2000
그제     3000
어제     2000
오늘     3000
dtype: int64

In [17]:
step = Series( [1000, 2000, 3000, 2000, 3000] )
print(step)
print("자료형 확인 : {}" .format( type(step)))

0    1000
1    2000
2    3000
3    2000
4    3000
dtype: int64
자료형 확인 : <class 'pandas.core.series.Series'>

In [18]:
print(step.index)

RangeIndex(start=0, stop=5, step=1)

In [19]:
print(step.values)

[1000 2000 3000 2000 3000]

In [20]:
print(step.dtype)

int64

In [27]:
step1 = Series( [1000, 2000, 3000, 2000, 3000],
    index = ["2020/05/03", "2020/05/04", "2020/05/05", "2020/05/06", "2020/05/07"])

step2 = Series ( [1000,3000, 2000, 3000, 2000],
     index = ["2020/05/05", "2020/05/06","2020/05/07", "2020/05/08", "2020/05/09"])

step1 + step2

2020/05/03       NaN
2020/05/04       NaN
2020/05/05    4000.0
2020/05/06    5000.0
2020/05/07    5000.0
2020/05/08       NaN
2020/05/09       NaN
dtype: float64

In [29]:
from pandas import DataFrame

dat = {'col1':[1,2,3,4],
       'col2':[10,20,30,40],
       'col3':['A','B','C','D']
      }
df = DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

In [33]:
from pandas import DataFrame

dat = {'team':["A팀","B팀","C팀","D팀"],
       'score_d1':[90, 95, 80, 97],
       'score_d2':[70, 92, 90, 89],
       'score_d3':[80, 90, 87, 79],
       'score_d4':[95, 89, 85, 87],
       'score_d5':[99, 99, 88, 94],
      }
df = DataFrame(dat)
df

  team  score_d1  score_d2  score_d3  score_d4  score_d5
0   A팀        90        70        80        95        99
1   B팀        95        92        90        89        99
2   C팀        80        90        87        85        88
3   D팀        97        89        79        87        94

In [35]:
from pandas import DataFrame

dat = {'team':["A팀","B팀","C팀","D팀"],
       'score_d1':[90, 95, 80, 97],
       'score_d2':[70, 92, 90, 89],
       'score_d3':[80, 90, 87, 79],
       'score_d4':[95, 89, 85, 87],
       'score_d5':[99, 99, 88, 94],
      }
df = DataFrame(dat, index=pd.date_range(start='10/5/2020', end='10/8/2020'))
df

           team  score_d1  score_d2  score_d3  score_d4  score_d5
2020-10-05   A팀        90        70        80        95        99
2020-10-06   B팀        95        92        90        89        99
2020-10-07   C팀        80        90        87        85        88
2020-10-08   D팀        97        89        79        87        94

In [40]:
ts_days_idx1 = pd.date_range('2019-10-05', periods=4)

team_df1 = DataFrame(dat, index= ts_days_idx1 )
team_df1

           team  score_d1  score_d2  score_d3  score_d4  score_d5
2019-10-05   A팀        90        70        80        95        99
2019-10-06   B팀        95        92        90        89        99
2019-10-07   C팀        80        90        87        85        88
2019-10-08   D팀        97        89        79        87        94